load-test.yml
config:
  target: "http://localhost:8080/api"

  tls:
    rejectUnauthorized: false

  plugins:
    expect: {}
    ensure: {}
  
  payload:
    path: "films.csv"
    fields:
      - "title"
      - "synopsis"
      - "releaseYear"
      - "ageRating"

  environments:
    local:
      phases:
        - duration: 40
          arrivalRate: 5
      ensure:
        maxErrorRate: 0
        thresholds:
          - "http.response_time.p95": 100

    staging:
      http:
        pool: 8
      phases:
        - duration: 40
          arrivalRate: 10
          rampTo: 50
          name: "Warm Up"

        - pause: 30

        - duration: 300
          arrivalRate: 50
          name: "Load test"
      ensure:
        maxErrorRate: 0
        thresholds:
          - "http.response_time.p95": 300
        
scenarios:
  - name: "Scenario 1: Get all films and retrieve the first one"
    weight: 70
    flow:
      - get:
          url: "/films/"
          capture:
            - json: "$[0].id"
              as: "filmId"
      - get:
          url: "/films/{{ filmId }}"

  - name: "Scenario 2: Create a film and retrieve it"
    weight: 20
    flow:
      - post:
          url: "/films/"
          json:
            title: "{{ title }}"
            synopsis: "{{ synopsis }}"
            releaseYear: "{{ releaseYear }}"
            ageRating: "{{ ageRating }}"
          capture:
            - json: "$.id"
              as: "filmId"
      - get:
          url: "/films/{{ filmId }}"

  - name: "Scenario 3: Create, retrieve and delete a film"
    weight: 10
    flow:
      - post:
          url: "/films/"
          json:
            title: "{{ title }}"
            synopsis: "{{ synopsis }}"
            releaseYear: "{{ releaseYear }}"
            ageRating: "{{ ageRating }}"
          capture:
            - json: "$.id"
              as: "filmId"
      - get:
          url: "/films/{{ filmId }}"
      - delete:
          url: "/films/{{ filmId }}"
      - get:
          url: "/films/{{ filmId }}"
          expect:
            - statusCode: 404